{
    "project_id": "RainWorld-Map",
    "title": "Rain World - World Map",
    "brief": "<p><a href='http://store.steampowered.com/app/312520/' target='_blank'>Rain World</a> is an upcoming <i>'survival platformer set in an abandoned industrial environment ravaged by a shattered ecosystem'</i>. In-game, the world consists of discrete rooms joined by abstract pipes - making it hard for a player to orientate themselves. For the severely lost, there is this map!</p>",
    "expandable": "<p>To make a map, the exits, connections and screenshots of each room were compiled manually into an <a href='http://sqlitebrowser.org/' target='_blank'>sqlite database</a>. An force-algorithm network was generated using the python <a href='https://networkx.github.io/' target='_blank'>NetworkX</a> module, and skinned using the PIL <a href='https://python-pillow.github.io/' target='_blank'>Pillow fork</a>. The resulting large image was sliced and output in <a href='https://github.com/turban/Leaflet.Zoomify' target='_blank'>Zoomify</a> format for web viewing with <a href='http://leafletjs.com/' target='_blank'>Leaflet</a>.</p><p>This was the first project I built using <a href='https://git-scm.com/' target='_blank'>git</a> and <a href='https://github.com/' target='_blank'>GitHub</a>, and now understand the benefits of version control!I plan to continue using git in my future projects, and enjoy contributing on GitHub.</p><p>This project had a few good challenges, mostly working with images bigger than single process memory allowance (~2GB).Hopefully I will continue to improve this project for the game's public release; potential improvements include eliminating manual data entry, improving readability and reducing stored image size.</p>",
    "project_links": [
        {"text": "project website", "href": "http://tommilligan.github.io/RainWorld-Map"},
        {"text": "source on Github", "href": "https://github.com/tommilligan/RainWorld-Map"},
        {"text": "official Rain World on Steam", "href": "http://store.steampowered.com/app/312520/"}
    ],
    "main_link": "http://tommilligan.github.io/RainWorld-Map",
    "tags": "python, sqlite, web design, image processing, git, version control"
}